-- Задача 3. Едно положително цяло число ще наричаме съвършено, ако е равно на сумата от своите делители (без самото число). Например: 6 е съвършено, защото 6 = 1+2+3, а числото 9 не е съвършено (1+3 ≠ 9). Да се дефинира функция, която проверява дали дадено положително цяло число е съвършено.

-- (Бонус): Да се състави списък от всички съвършени числа.

main :: IO()
main = do
  print $ task3 8128
  print $ take 3 bonusTask3

task3 :: Int -> Bool
task3 n = n == sum [d | d <- [1..n-1], n `mod` d == 0]

bonusTask3 :: [Int]
bonusTask3 = filter task3 [1..]
