-- Задача 2. Да се напише функция, която за даден символен низ, съдържащ само латински букви и интервали, да намира броя на думите, започващи с главна буква. “Дума” дефинираме като последователност от букви, отделени от останалите символи с интервал или краищата на низа.

-- Пример: за символния низ “Hi how are you Today”, търсеното число е 2

import Data.Char

main :: IO()
main = do
  print $ task2 "Hi how are you Today"

task2 :: String -> Int
task2 str =
  length [word | word@(c:_) <- words str, isUpper c]