-- Да се съставят следните списъци:
-- а) Първите n четни числа;
-- б) Първите n члена на аритметична прогресия с първи член a и разлика d;
-- в) [1!, 2!, ..., n!] за дадено n;
-- г) Всички четни числа;
-- д) Всички членове на аритметична прогресия с първи член a и разлика d;
-- е) [1!, 2!, ...] (безкраен списък)

-- a)
listA :: Int -> [Int]
listA n = [2 * i | i <- [0..n-1]]

listA' :: Int -> [Int]
listA' n = take n [0,2..]
-- б)
listB :: Int -> Int -> Int -> [Int]
listB n a d = take n [a, a + d ..]
-- в)
fact :: Int -> Int
fact 0 = 1
fact x =  x * fact (x - 1)
listC :: Int -> [Int]
listC n = [fact x | x <- [1..n]]
-- г)
listD = [0,2..]
-- д)
listE a d = [x | x <- [a,a + d ..]]
-- е)
listF = [fact x | x <- [1..]]